module attributes {torch.debug_module_name = "Conv2d"} {
  func.func @forward(%arg0: tensor<1x3x64x64xf32>) -> tensor<1x6x58x58xf32> {
    %0 = "tosa.const"() <{value = dense<[-0.0675533265, -0.0786442235, -7.646190e-02, -0.00229380699, -0.0799340755, -0.0737717897]> : tensor<6xf32>}> : () -> tensor<6xf32>
    %1 = "tosa.const"() <{value = dense<"0x00F3E3BCE91499BC4D0F9C3C936104BD580BEBBC1942923DEDD7DA3BC9C2963D2F36BD3C2DC4CB3C38CFA43D90A9D0BC7E658ABD090572BD4436BABC358A7E3DAAAE4FBD66939F3DFC120E3D0A308D3D83ECA5BD3B6D8CBD96B889BD1FCA88BD04DF43BDF4DB943D7DE16E3D6B26A23D772F733DCD41653BB4FC2FBCFD2B593D19F3773D55F176BDC9E1A13DEC01243D0410D5BBD5236C3C00FE183C0F4BEB3C1E6F7F3DFE6234BD550FE7BC97680F3D9E5921BC667D993D42619CBD393584BD90C694BB19A06C3D9BF046BD98797A3D59A79B3D7A97B63C0A45D6BC7E0B283DA2A521BD5CB3EABBE7588B3D5F2F473D0F34F23CACA068BD5A88C93C3649613CDC5F2EBDA80F43BDBE098CBDD82076BD64A80D3D5CF031BDC6C4F73C17CA43BBC0D7A4BCF537CC3C2D8C3FBB4A174B3D3C8A283D4EE2E8BC3947453D8012993D70CA143D996491BD41F74CBD88BA2D3D8C14F93AE1C79ABCE70459BDD07601BDAC8614BD47CEA8BC2E6335BD8A1E6D3DB0879A3D3F9C3E3D2EEB7EBD6B11723DC3F392BD085D823D390F1BBC23CBA9BBEAC1243CC78E803DBE4C75BB632A7E3A836796BC2AC5A33D4F474ABD9872B5BCB8BBD73CA6AA28BD377DA13D650B81BDD1BB1A3D40DD8ABC92B3C63CD65B66BD190C7BBD5812583D74BAE4BB8F8FD6BC62C5A3BD2AA8A33D8F769E3DAC4B543CEB06673D09449BBD0A5FE8BB0AF14DBD1DCC6ABDDBF78C3D98C81E3B709A85BDF6AB8CBDA88F51BD59A992BD0362CDBCD010CDBBCFB4A43D5D7184BD3688633B0588CFBB3105753C40D5353D66C7473DC9F7253CD2AB9BBD38B8523DE6AF4CBC924AE73B714514BD889EA5BDDA9EA2BCB863843D77781E3C1C15853D507E66BD41E6C0BA8E090F3D90141ABD06AB563D506318BCA78B18BD42013BBDE825723D77E68F3D5A0C963C5AF02BBD8E9851BD4F5C373D8A02933C274807BCA927803C2FB52EBC8E600DBDD9CB6BBD50F88C3C172B0B3D05B496BD72B501BDE750233C5BB7823D21AF5CBC5D245BBD94B80A3D5DDCF13C64B1A2BDB86229BC822A42BD48337D3C9A8079BDCF099DBC77CC9FBCC1AAE8BACB28A13D69A051BD301900BD6F11803D3CFEA73DD4F0703DC4FA763D4173913D60E08B3DF7FE483D64BBDA3A538FB73C0A26B7BBA4758DBD95C9AABB99FF783CCE34533D52C8453D407560BDBFF095BD4AAA5B3C13886C3DCA13493D559485BCA77BB73C0282133BBB48D33B5174163CFC9E98BCF18A953AB7F1A3BDA9A25BBCE2EB6BBD6E435C3D30128ABD1E78A23DA469A43C2501B5BC7BD4503DCB51303D5DFD1C3D220266BD2EC7833D422F54BDF5635CBDC547CF3CF680373D0EC7A03D674734BBD3CC9C3D552F6A3DA66F91BD49892F3D047CCA3C122FC6BB52D49E3DD84296BD5BFB843CEB16AFBBC917773D2AC78C3D03190FBDE8AFA83D5D08DB3CCF6AA5BD5FBB9C3C66FF84BD948811BC25A28B3DE2A0F9BC8B83BB3ACDD027BDB67C9DBDF0A1B8BB5FF2693D0E5D31BDDCBB073D7A7C663D4397863D06FFA1BD4FE0CABCB63021BCDF2C2F3D549B22BC21833E3D7EEF8C3DA9271B3D203C603D4EC4273C818DA83DC3FE3ABD73DB963D51D5E23CAAB4F53CC56B91BDDC7B9E3DF914823DDAFF8C3D0DA1A3BC8FE76DBDA8DD693DB21C293C284689BD23423BBD5A2C28BCA883253D361FA53DF6FE86BD44F1173D6A640E3C0FC660BD38CF6EBDBE67DCBC6FA35EBD77E57CBC8553EABCAC2E383DDD65C8BC431495BDB0393FBD47943CBD2702663DD8376CBD9B104A3D94787E3D544FB9BC33F6CEBB0C21D5BC522D1C3D55DB10BCE0039BBD3EFDD2BC57BA48BD00DF99BD01EADEBC853D9CBDEB8081BC651F863DE5DA40BDC3A5F4BC82E780BCFD9B9C3C60CA0A3D239EAABC873E9A3D0D3FA1BD0DBA813D5837C53C28428A3DB204043D0945D4BC6E44A2BD559E8E3C8A7399BDA19568BD7FA5B3BC8274F9BC5C6B4F3DDF3E043DBD10693DBE599B3D5AAE98BD147B7ABDFAFE20BDB4808CBDB6AD003D76407BBD8D9C92BB21F25BBCF0228FB96B892BBDF272233D859B15BDAD8809BCFCDF433CCAAC753C89C3A2BD8B119F3D1929873B4B73BB3B931672BD7D3970BD4CA6763D39577D3D3F1657BD2BF6F03C17DB373D4825FDBC1995903DE049A8BDC522D93C514AB0BBA632A4BC2247853DDBC744BDAD145F3D04446ABB1173C73CD827D3BCCC8B8BBA67C148BD728B2DBD79142B3D0B0436BCBD181A3D9E5D593D6E12A43DD551943CE1E7773DB7FAA43DF13E54BD953E9CBB54D51E3DF07575BC305F873D8E886ABC2DCA453DD71F6EBD5C9F4EBDE9C226BDBEE07C3D85A5D63C3D8AAD3C7253B43BE6A9C93CF01C733DF9D63C3DF0950ABD21F0D2BC72AAA5BDE3868A3DC0D9603DB20F843D0826693D0EBC91BD8016AABCEB4BDD3B3E255EBD1228823D8548A1BD776C173DD223A7BD92377D3B4B488D3C4E60E4BB61A57FBC6EA757BC0CF18F3D0E14323D8B4CB6BBDC4F9C3DD2C22D3CD4C7EE3C287D3D3D4D7EDCBC2E7B4D3D8CFB4D3D315D7A3DB8C2443C97588A3D6731D4BA855C61BD3ED28EBD05134DBD621E8FBD339BBD3CCCB004BD59B01E3B6F9C6E3D7AB62C3B9DFB523B118C6C3D7C0692BCCFC23DBD12CB183DA77337BD1080A23DE6E69EBDCFD542BD0A3B5C3C5D36123CD211363CF1DF19BDC9B3FD3BD7DAE5BCB4F79F3D086194BDD6C2D73C9FC7933BD70C8E3DE7CCD93C4AE7A7BDEE042CBD3BAE5F3D1B4F923C3284483D589408BD4343CE3C2291B2BCE57D2CBDED39503CDB61F53BA39073BD6DCB98BDD1DA163D012F1D39598986BD8A03A3BC7D5B9CBCC296D6BC055B3C3C179F893D0029F9BCAA29A1BDC70FEE3B3340A83D23505DBDBBDA733DEEE354BCB5AC963DB32C5CBD1EACADBC1085783D7199513DD9A98DBC548F1CBA307086BDE801793D939200BBA2AF0E3B8D6DD7BCDAE0463C46825D3D908398BCB97993BD62A4493DAA2D003D65B6823DD89C643C4C8D09BD8AA5963D781F33BD3E92A23D5C95ACBC3E742F3CCE958D3D46CC3A3B25C56D3DA2F70D3D2F59A83DEBA601BD8E96BEBB793D4D3C7CFD50BCB16062BD0C90E3BC6020FABC5903A4BDE8CA1FBD739D633C77B836BD19BB08BB4AB435BC40229FBDD84A203D9217CEBC6689A1BDF2A8473CFA6987BD4E728FBC18928D3D54463ABB9CF132BC88AF60BD0F9B89BDAF8E72BDD7F83FBD8858B83BB4338C3D54B28B3DA6467EBD08D25D3B29F413BCC0C91E3BA832F83C5FBF993DC70B2D3DE2342A3D2691953C8ADF6E3C959F313DD20602BDED0F243DDA1008BDA1EE9F3C199E2EBD320A813D8B8F25BD262ECB3BB5E6583DF47DA23D6330A2BD7E87003D7085663D774256BDEE30253D5BE7C2BC0BC54EBDEFA4AE3B99A6A63D3F1C6C3CE0040CBDE9AE46BC649EBBBCC7757CBD7899AB3C13F0033D4B04523DFBEBB53C0A6DCBBC65674D3D3FA28E3DE86471BD7C457F3DBF025FBDEC298C3D28401F3D06C5C8BCC5E1A1BC08D9A3BD823F973D804900BC3A11C43CC318A33D3DF067BD2EE7483D02BB5ABDA752093C3AB7D4BCE283913DA63991BB27CF7CBB9F2D673D0E3629BD7F5490BD048F6F3C3BE880BC9BFA9D3C90F1F43CED233D3D20E46D3D71B38ABDD2C599BD4F80A9BC2A26BA3BB6C5B2BCADB1153DA5374F3DF3F2F03C06CD7DBD9F5EA63D906B10BD2CED9F3D8D78CA3C1B3606BDD44D703AAF63153981579CBD4805203DED63363C6185EDBB9600F93C326517BDAEA155BD89028E3DE0A09E3D19B89E3C398C153DBC07553D9B76C53C022D9C3D13A00EBD2E1294BB81F0E3BC7881E6BC9D7531BD1F3F84BDC190B0BB6B40F7BC76CD84BDF6A786BDBA1E873DE83008BC1C4BDE3B651826BD56ED72BD8D6D32BD414E96BC14AD0EBD9F7C273DF8242B3B278342BDD8E0053DC74283BAEFAB99BDB030E2BC561B523D00817B3D50A539BDEB9455BDDCD192BDCC69953DCD621D3DD36A97BCD63C09BC37D15DBD72B38C3DCD3C75BDE184D03C882EA03D3D10A43DE57F033D00E93E3D67EE533DDF4D10BD6068823C375D863D2F1F11BDF898843D11002ABDD088BF3C5CF369BD325C72BDD79F3ABD292DA6BD8D03303D6929173DCC2BF13C3B7C3A3C4EABA6BDDDAAA3BDBCCD1A3C34A1513C6660903B5737ECBC684FC23CB3F67EBD7FB9BC3C3221BABC645CCC3C13802D3DB517393D3E08073D2BD6A83D4B5B3BBC431629BB05D982BC3AB885BD2E436D3DADD405BDCE0FF6BC605C893DBF78DA3B41F726BDA6D179BD57716BBDAD01A43C33FE89BD8B9BCDBA2F8820BD89FC2A3D300DEDBCF721043DAC5012BBB7FA9C3C29915DBDF51B75BDBCC33F3D991CE93C867A3C3CC410EB3C4730663DEC9CFC3C5603FEBC55272CBC2A24633C3E49003DCCC2623CBE06863DC4E926BD72C24B3DE1EE973D55DE67BDC7C22A3C854E673DEE9DB93C90B0AE3C96206CBDE3D754BDBF87C73CCB8E8F3DE155A63D80D8F8BBABBF943D7F8A863D980F7BBD14D9723B001483BD98431D3D1D70463DAB989BBD92ADA1BD54968D3D8C2541BD1F76713D6828A4BD8A848B392AA1883DA6D39BBDAA8B2E3D7C15DDB88280153C6E7E9F3DC42B993D440F6C3DA679CF3CD30A7D3CC7264CBDAA7D373D2742873DACC92CBD47C8413D79E8753DC9E7453D9CF873BD22B194BDAFC186BD4939363C797E8DBD77099CBC14E17BBDAC8E203DE255F43C082AEDBCC04BA0BD3EF881BC542AA0BDF0E4A0BD03B880BD071E27BD9F27F33CD0A3E1BC0615873DC28A87BDF017B43CDEAB743C4D370C3DF55D983D257B75BDC243B9BC0C5A86BD8B4030BC228C5EBDE7783EBDDEED4EBBA22E203C6B43A63BCB509D3D4DD9643C604D06BB1612F13C0EBE2ABDDC16493B95AA9FBD194D3CBDC5278E3D2DC64BBDB39F54BD1DD2883DFC8306BD3FE182BDB493E2BC7801803DD37F933D69FE5C3DD5C34ABD32188CBD17B01EBDAD44D8BC"> : tensor<6x3x7x7xf32>}> : () -> tensor<6x3x7x7xf32>
    %2 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %3 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %4 = tosa.transpose %arg0, %2 : (tensor<1x3x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x3xf32>
    %5 = tosa.transpose %1, %2 : (tensor<6x3x7x7xf32>, tensor<4xi32>) -> tensor<6x7x7x3xf32>
    %6 = tosa.conv2d %4, %5, %0 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x64x64x3xf32>, tensor<6x7x7x3xf32>, tensor<6xf32>) -> tensor<1x58x58x6xf32>
    %7 = tosa.transpose %6, %3 : (tensor<1x58x58x6xf32>, tensor<4xi32>) -> tensor<1x6x58x58xf32>
    return %7 : tensor<1x6x58x58xf32>
  }
}

